Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: ``sayhello`` depends on ``libhello`` at compile time as it needs the shared library to do the dynamic linking process. It also depends on it at runtime as the shared library loader needs to find the library. For more details about dependencies check :ref:`ref-varlocality-recipe-dependencies`.
it_it: ``sayhello`` dipende da ``libhello`` in fase di compilazione, poiché necessita della libreria shared per eseguire il processo di link dinamico. Dipende da essa anche in fase di esecuzione, poiché il loader di librerie shared deve trovare la libreria. Per maggiori dettagli sulle dipendenze, consultare :ref:`ref-varlocality-recipe-dependencies`.

source: ``sayhello`` sources are as follows:
it_it: I sorgenti di ``sayhello`` sono i seguenti:

source: ``sayhello``: A recipe that uses ``libhello`` library to do its job
it_it: ``sayhello``: Una ricetta che utilizza la libreria ``libhello`` per svolgere il suo compito

source: ``shlibdeps``: During the :ref:`ref-tasks-package` task of each recipe, all shared libraries installed by the recipe are located. For each shared library, the package that contains the shared library is registered as providing the shared library. More specifically, the package is registered as providing the :wikipedia:`soname <Soname>` of the library. The resulting shared-library-to-package mapping is saved globally in :term:`PKGDATA_DIR` by the :ref:`ref-tasks-packagedata` task.
it_it: ``shlibdeps``: Durante il task :ref:`ref-tasks-package` di ogni ricetta, vengono individuate tutte le librerie shared installate dalla ricetta. Per ogni libreria shared, il pacchetto che la contiene viene registrato come fornitore della libreria stessa. Più specificamente, il pacchetto viene registrato come fornitore del :wikipedia:`soname <Soname>` della libreria. La mappatura risultante tra shared condivise e pacchetti viene salvata a livello globale in :term:`PKGDATA_DIR` dal task :ref:`ref-tasks-packagedata`.

source: ``sstate-inputdirs`` and ``sstate-outputdirs`` can also be used with multiple directories. For example, the following declares :term:`PKGDESTWORK` and ``SHLIBWORK`` as shared state input directories, which populates the shared state cache, and :term:`PKGDATA_DIR` and ``SHLIBSDIR`` as the corresponding shared state output directories::
it_it: ``sstate-inputdirs`` e ``sstate-outputdirs`` possono essere utilizzati anche con più directory. Ad esempio, il seguente codice dichiara :term:`PKGDESTWORK` e ``SHLIBWORK`` come directory di input dello stato condiviso, che popolano la cache dello stato condiviso, e :term:`PKGDATA_DIR` e ``SHLIBSDIR`` come corrispondenti directory di output dello stato condiviso [shared state]::

source: ``sstate_setscene()`` takes the flags above as input and accelerates the :ref:`ref-tasks-deploy` task through the shared state cache if possible. If the task was accelerated, ``sstate_setscene()`` returns True. Otherwise, it returns False, and the normal :ref:`ref-tasks-deploy` task runs. For more information, see the ":ref:`bitbake-user-manual/bitbake-user-manual-execution:setscene`" section in the BitBake User Manual.
it_it: ``sstate_setscene()`` accetta i flag sopra indicati come input e, se possibile, accelera il task :ref:`ref-tasks-deploy` attraverso la cache di shared state. Se il task è stato accelerato, ``sstate_setscene()`` restituisce True. Altrimenti, restituisce False e viene eseguito il normale task :ref:`ref-tasks-deploy`. Per ulteriori informazioni, consultare la sezione ":ref:`bitbake-user-manual/bitbake-user-manual-execution:setscene`" nel Manuale Utente di BitBake.

source: ``testimage``: build an image, boot it and run testcases on it
it_it: ``testimage``: creare un'immagine, avviarla ed eseguirci i test

source: ``testsdk_ext``: to build, install and run tests against an extended SDK
it_it: ``testsdk_ext``: per compilare, installare ed eseguire test su un SDK esteso

source: ``testsdk``: to build, install and run tests against a SDK
it_it: ``testsdk``: per compilare, installare ed eseguire test su un SDK

source: ``upstream ticket <link>``: the issue is not specific to Open-Embedded and should be fixed upstream, but the patch in its current form is not suitable for merging upstream, and the author lacks sufficient expertise to develop a proper patch. Instead the issue is handled via a bug report (include link).
it_it: ``upstream ticket <link>``: il problema non è specifico di OpenEmbedded e dovrebbe essere risolto al progetto upstream, ma la patch nella sua forma attuale non è adatta per l'unione al progetto upstream e l'autore non possiede le competenze sufficienti per sviluppare una patch adeguata. Il problema viene quindi gestito tramite una segnalazione di bug (includere il link).

source: ``virtual/compilerlibs``: Runtime libraries resulting from the toolchain bootstrapping process. This tool produces a binary that consists of the runtime libraries need for the targeted device.
it_it: ``virtual/compilerlibs``: Librerie runtime risultanti dal processo di bootstrapping della toolchain. Questo strumento produce un binario contenente le librerie runtime necessarie per il dispositivo target.

source: ``virtual/cross-binutils``: The binary utilities needed in order to run the ``virtual/cross-cc`` phase of the bootstrap operation and build the headers for the C library.
it_it: ``virtual/cross-binutils``: Le utilità binarie necessarie per eseguire la fase ``virtual/cross-cc`` dell'operazione di bootstrap e compilare gli header per la libreria C.

source: ``virtual/cross-cc``: The final stage of the bootstrap process for the cross-compiler. This stage results in the actual cross-compiler that BitBake uses when it builds an image for a targeted device.
it_it: ``virtual/cross-cc``: La fase finale del processo di bootstrap per il cross-compilatore. Questa fase genera il cross-compilatore effettivo che BitBake utilizza per creare un'immagine per un dispositivo target.

source: ``virtual/libc``: An provider of the C Standard Library (for example, the GNU C Library).
it_it: ``virtual/libc``: Un provider della libreria standard C (ad esempio, la libreria C GNU).

source: `trace-cmd: A front-end for ftrace <https://lwn.net/Articles/410200/>`__
it_it: `trace-cmd: Un'interfaccia per ftrace <https://lwn.net/Articles/410200/>`__

source: add a package to an image
it_it: aggiungere un pacchetto a un'immagine

source: add an SSH server to an image (enable transferring of files to target)
it_it: aggiungere un server SSH a un'immagine (abilitazione del trasferimento file sul target)

source: and so on.
it_it: e così via.

source: and, finally, modify ``X``.
it_it: e, infine, modificare ``X``.

source: blktrace Documentation
it_it: Documentazione di blktrace

source: blktrace Setup
it_it: Configurazione di blktrace

source: blktrace and blkparse are designed from the ground up to be able to operate together in a "pipe mode" where the standard output of blktrace can be fed directly into the standard input of blkparse::
it_it: blktrace e blkparse sono stati progettati fin dall'inizio per funzionare insieme in "pipe mode", in cui l'output standard di blktrace può essere inviato direttamente all'input standard di blkparse::

source: blktrace is a tool for tracing and reporting low-level disk I/O. blktrace provides the tracing half of the equation; its output can be piped into the blkparse program, which renders the data in a human-readable form and does some basic analysis:
it_it: blktrace è un tool per il tracing e il reporting delle operazioni di I/O del disco di basso livello. blktrace fornisce la parte di tracing; il suo output può essere inviato tramite pipe al programma blkparse, che elabora i dati in un formato leggibile e ne esegue alcune analisi di base:

source: blktrace is an application that runs on the target system. You can run the entire blktrace and blkparse pipeline on the target, or you can run blktrace in 'listen' mode on the target and have blktrace and blkparse collect and analyze the data on the host (see the ":ref:`profile-manual/usage:Using blktrace Remotely`" section below). For the rest of this section we assume you've to the host through SSH and will be running blktrace on the target.
it_it: blktrace è un'applicazione che viene eseguita sul target. È possibile eseguire l'intera pipeline blktrace e blkparse sul target, oppure eseguire blktrace in modalità 'listen' sul target e fare in modo che blktrace e blkparse raccolgano e analizzino i dati sull'host (vedere la sezione ":ref:`profile-manual/usage:Using blktrace Remotely`" di seguito). Per il resto di questa sezione, si presume si sia connessi all'host tramite SSH e che si esegua blktrace sul target.

source: bootloaders: If applicable to the target machine, bootloaders supporting the image. The ``deploy/images/``\ machine directory can contain multiple bootloaders for the machine.
it_it: bootloaders: Se applicabile alla macchina target, bootloader che supportano l'immagine. La directory ``deploy/images/``\ machine può contenere più bootloader per la macchina.

source: build a package by itself and understand why that's useful
it_it: configurare un pacchetto in autonomia e capire l'utilità di tale procedura

source: build an Extensible SDK for applications development
it_it: configurare un Extensible SDK per lo sviluppo di applicazioni

source: check how upstream developers of the software component addressed the issue, e.g. what patch was applied, which upstream release contains the fix.
it_it: verificare come gli sviluppatori del componente software hanno affrontato il problema, ad esempio quale patch è stata applicata e quale release contiene la correzione.

source: check what other Linux distributions like `Debian <https://security-tracker.debian.org/tracker/>`__ did to analyze and address the issue.
it_it: controllare cosa hanno fatto altre distribuzioni Linux, come `Debian <https://security-tracker.debian.org/tracker/>`__, per analizzare e risolvere il problema.

source: copy a file ``X`` to ``X.orig`` (only if it doesn't exist already)
it_it: copiare il file ``X`` in ``X.orig`` (solo se non esiste già)

source: deal with corporate proxies
it_it: gestire i proxy aziendali

source: find and use the right BSP (machine) for your hardware
it_it: cercare e usare il BSP (machine) corretto per l'hardware in uso

source: find examples of DISTRO features and know where to set them
it_it: cercare esempi di funzionalità DISTRO e individuare la loro corretta collocazione

source: find out what files are in a package
it_it: identificare i file contenuti in un pacchetto

source: find out what files are in an image
it_it: identificazione i file contenuti in un'immagine

source: find out what packages are created by a recipe
it_it: identificare i pacchetti creati da una ricetta

source: find recipes (with the :oe_layerindex:`OpenEmbedded Layer index <>`)
it_it: cercare ricette (con lo :oe_layerindex:`OpenEmbedded Layer index <>`)

source: follow public `open source security mailing lists <https://oss-security.openwall.org/wiki/mailing-lists>`__ for discussions and advance notifications of CVE bugs and software releases with fixes.
it_it: seguire le `mailing list pubbliche sulla sicurezza open source <https://oss-security.openwall.org/wiki/mailing-lists>`__ per discussioni e notifiche anticipate sui bug CVE e sulle release software con le relative correzioni.

source: follow security notices from other Linux distributions.
it_it: seguire gli avvisi di sicurezza di altre distribuzioni Linux.

source: ftrace Documentation
it_it: Documentazione di ftrace

source: ftrace Setup
it_it: Configurazione di ftrace

source: ftrace, trace-cmd, and KernelShark run on the target system, and are ready to go out-of-the-box --- no additional setup is necessary. For the rest of this section we assume you're connected to the host through SSH and will be running ftrace on the target. KernelShark is a GUI application and if you use the ``-X`` option to ``ssh`` you can have the KernelShark GUI run on the target but display remotely on the host if you want.
it_it: ftrace, trace-cmd e KernelShark vengono eseguiti sul sistema target e sono pronti all'uso fin da subito: non è necessaria alcuna configurazione aggiuntiva. Per il resto di questa sezione, si presume che si sia connessi all'host tramite SSH e che si esegua ftrace sul sistema target. KernelShark è un'applicazione con interfaccia grafica e, utilizzando l'opzione ``-X`` a ``ssh``, è possibile eseguire l'interfaccia grafica di KernelShark sul sistema target e visualizzarla in remoto sull'host, se lo si desidera.

source: gcc 10.1 or greater
it_it: gcc 10.1 o superiore

source: generate and understand BitBake environment
it_it: generare e comprendere l'ambiente BitBake

source: generate and understand a dependency graph
it_it: generare e comprendere un grafo delle dipendenze

source: improve build speeds with shared downloads and shared state cache
it_it: migliorare la velocità di build tramite download e cache di stato condivisi [shared]

source: kernel-image: A kernel binary file. The :term:`KERNEL_IMAGETYPE` variable determines the naming scheme for the kernel image file. Depending on this variable, the file could begin with a variety of naming strings. The ``deploy/images/``\ machine directory can contain multiple image files for the machine.
it_it: kernel-image: Un file binario del kernel. La variabile :term:`KERNEL_IMAGETYPE` determina lo schema di denominazione per il file immagine del kernel. A seconda di questa variabile, il file può iniziare con diverse stringhe di denominazione. La directory ``deploy/images/``\ machine può contenere più file immagine per la macchina.

source: kernel-modules: Tarballs that contain all the modules built for the kernel. Kernel module tarballs exist for legacy purposes and can be suppressed by setting the :term:`MODULE_TARBALL_DEPLOY` variable to "0". The ``deploy/images/``\ machine directory can contain multiple kernel module tarballs for the machine.
it_it: kernel-modules: Archivi tar [tarball] contenenti tutti i moduli compilati per il kernel. Gli archivi tar dei moduli del kernel esistono per scopi legacy e possono essere disabilitati impostando la variabile :term:`MODULE_TARBALL_DEPLOY` a "0". La directory ``deploy/images/``\ machine può contenere più archivi tarball di moduli del kernel per la macchina.

source: know how to create and use layers
it_it: conoscere la creazione e l'utilizzo dei layer

source: know the anatomy of a recipe
it_it: conoscere l'anatomia di una ricetta

source: meta-agl-core layer testing
it_it: Test del layer meta-agl-core

source: meta-arm layer testing
it_it: Test del layer meta-arm

source: meta-aws layer testing
it_it: Test del layer meta-aws

source: meta-exein layer testing
it_it: Test del layer meta-exein

source: meta-intel layer testing
it_it: Test del layer meta-intel

source: meta-openembedded layer testing
it_it: Test del layer meta-openembedded

source: meta-virtualization layer testing
it_it: Test del layer meta-virtualization

source: meta-virtualization mailing list <meta-virtualization@lists.yoctoproject.org>
it_it: mailing list di meta-virtualization <meta-virtualization@lists.yoctoproject.org>

source: meta-webosose layer testing
it_it: Test del layer meta-webosose

source: mingw based SDKs testing
it_it: Test degli SDK basati su mingw

source: openSUSE Leap 15.6 Packages
it_it: Pacchetti openSUSE Leap 15.6

source: openSUSE Leap 16.0 Packages
it_it: Pacchetti openSUSE Leap 16.0

source: openSUSE Leap Packages
it_it: Pacchetti openSUSE Leap

source: or to build the extended tarball::
it_it: oppure per creare il tarball esteso::

source: or to build the make-only tarball::
it_it: oppure per creare il tarball con soll make::

source: perf Documentation
it_it: Documentazione di perf

source: perf Setup
it_it: Configurazione di perf

source: perf isn't restricted to the fixed set of static tracepoints listed by ``perf list``. Users can also add their own "dynamic" tracepoints anywhere in the kernel. For example, suppose we want to define our own tracepoint on ``do_fork()``. We can do that using the ``perf probe`` perf subcommand::
it_it: perf non è limitato al set fisso di tracepoint statici elencati da ``perf list``. Gli utenti possono anche aggiungere i propri tracepoint "dinamici" in qualsiasi punto del kernel. Ad esempio, supponiamo di voler definire un nostro tracepoint su ``do_fork()``. Possiamo farlo usando il sottocomando ``perf probe`` di perf::

source: perf runs on the target system for the most part. You can archive profile data and copy it to the host for analysis, but for the rest of this document we assume you're connected to the host through SSH and will be running the perf commands on the target.
it_it: perf viene eseguito principalmente sul sistema target. È possibile archiviare i dati di profilazione e copiarli sull'host per l'analisi, ma per il resto di questo documento si presuppone che si sia connessi all'host tramite SSH ed si eseguiranno i comandi perf sul sistema target.

source: pkgman-non-rpm (other builders use RPM by default)
it_it: pkgman-non-rpm (altri builder utilizzano RPM per default)

source: reproducibility testing
it_it: Test di riproducibilità

source: root-filesystem-image: Root filesystems for the target device (e.g. ``*.ext3`` or ``*.bz2`` files). The :term:`IMAGE_FSTYPES` variable determines the root filesystem image type. The ``deploy/images/``\ machine directory can contain multiple root filesystems for the machine.
it_it: root-filesystem-image: Filesystem root per il dispositivo target (ad esempio, file ``*.ext3`` o ``*.bz2``). La variabile :term:`IMAGE_FSTYPES` determina il tipo di immagine del filesystem root. La directory ``deploy/images/``\ machine può contenere più filesystem root per la macchina.

source: showing four machine configuration files along with a lower-level tuning configuration file.
it_it: che mostra quattro file di configurazione della macchina insieme a un file di configurazione di ottimizzazione di livello inferiore.

source: study the latest information in `CVE database <https://nvd.nist.gov/vuln/search>`__.
it_it: studiare le informazioni più recenti nel `database CVE <https://nvd.nist.gov/vuln/search>`__.

source: symlinks: The ``deploy/images/``\ machine folder contains a symbolic link that points to the most recently built file for each machine. These links might be useful for external scripts that need to obtain the latest version of each file.
it_it: symlinks: La cartella ``deploy/images/``\ machine contiene un link simbolico che punta al file compilato più di recente per ciascuna macchina. Questi link possono essere utili per script esterni che necessitano di ottenere la versione più recente di ciascun file.

source: tar 1.28 or greater
it_it: tar 1.28 o superiore

source: the perf_events subsystem
it_it: il perf_events subsystem

source: then, copy ``X.orig`` back to ``X``,
it_it: quindi, copiare ``X.orig`` nuovamente in ``X``,

source: to your distro :term:`configuration file`, or by enabling the exactly equivalent configuration fragment :ref:`ref-fragments-root-login-with-empty-password`.
it_it: al :term:`configuration file` della propria distribuzione, oppure abilitando il frammento di configurazione esattamente equivalente :ref:`ref-fragments-root-login-with-empty-password`.

source: trace-cmd is essentially an extensive command-line "wrapper" interface that hides the details of all the individual files in ``/sys/kernel/debug/tracing``, allowing users to specify specific particular events within the ``/sys/kernel/debug/tracing/events/`` subdirectory and to collect traces and avoid having to deal with those details directly.
it_it: trace-cmd è essenzialmente un'interfaccia "wrapper" da riga di comando estesa che nasconde i dettagli di tutti i singoli file in ``/sys/kernel/debug/tracing``, consentendo agli utenti di specificare eventi specifici all'interno della sottocartella ``/sys/kernel/debug/tracing/events/`` e di raccogliere tracce evitando di dover gestire direttamente tali dettagli.

source: understand devtool and how it simplifies your workflow
it_it: capire devtool e la semplificazione del flusso di lavoro

source: understand the difference between MACHINE and DISTRO settings
it_it: Capire la differenza tra le impostazioni MACHINE e DISTRO

source: understand the difference between a recipe and a package
it_it: comprendere la differenza tra una ricetta e un pacchetto

source: understand the task pipeline and how to execute individual tasks
it_it: capire la pipeline dei task e l'esecuzione dei singoli task
